### Import required dependencies

In [1]:
import pandas as pd
import os

## Deliverable 1: Collect the Data

To collect the data that youâ€™ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [2]:
# Create the path and import the data
full_student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [3]:
# passed tail from student_df then checked against CSV in VS Code
student_df.tail()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
19509,109236636,Robert Sawyer,12th,Silva High School,43.3,27.2,Public,991918
19510,63239258,David Herman,9th,Woods High School,52.1,80.4,Public,912243
19511,95516554,Megan Gill,11th,Wagner High School,93.9,84.1,Public,846745
19512,65050383,Lori Stone,11th,Bowers High School,94.6,70.9,Public,848324
19513,34720657,Anna Jensen,12th,Montgomery High School,82.3,42.4,Charter,893368

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [5]:
# Check for null values
student_df.isna()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...
19509,False,False,False,False,False,False,False,False
19510,False,False,False,False,False,False,False,False
19511,False,False,False,False,False,False,False,False
19512,False,False,False,False,False,False,False,False
19513,False,False,False,False,False,False,False,False

In [6]:
# Drop rows with null values and verify removal
# used isna() with sum() to obtain NaN of each attribute
# sourced additional arguements (how='any', inplace=True) to resolve inability to drop Nan values
student_df.dropna(how='any', inplace=True)
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [7]:
# Check for duplicated rows
# used some again to obtain total number of dupes
student_df.duplicated().sum()

1836

In [8]:
# Drop duplicated rows and verify removal
# used sum() on duplicated to confirm drop_duplicates() was successful
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [9]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [10]:
# Examine the grade column to understand why it is not an int
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [11]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [12]:
# Change the grade column to the int type and verify column types
# arguments from "pandas_practice" failed here, but lifted to_numeric from stackovcerlfow with success, it seems
student_df['grade'] = pd.to_numeric(student_df['grade'])

In [13]:
student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [14]:
# Display summary statistics for the DataFrame
description = student_df.describe()
description

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [15]:
# Display the mean math score using the mean function
math_score = student_df['math_score'].mean()
math_score

64.67573326141189

In [16]:
# Store the minimum reading score as min_reading_score
reading_score_min = student_df['reading_score'].min()
reading_score_min

10.5

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [17]:
# Use loc to display the grade column
grade_column = student_df.loc[:,['grade']]
grade_column

       grade
0          9
1          9
2          9
3          9
5          9
...      ...
19508     10
19509     12
19511     11
19512     11
19513     12

[14831 rows x 1 columns]

In [18]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
rows_columns = student_df.iloc[:3,1:4]
rows_columns

      student_name  grade           school_name
0    Travis Martin      9  Sullivan High School
1    Michael Brown      9     Dixon High School
2  Gabriela Lucero      9    Wagner High School

In [19]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
grade_9 = student_df.loc[(student_df['grade'] == 9)].describe()
grade_9

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [20]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_row = student_df.loc[:,['reading_score']].min()
(min_reading_row)

reading_score    10.5
dtype: float64

In [21]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
dixon_school = student_df.loc[(student_df["school_name"] == "Dixon High School")]
grade_10 = dixon_school.loc[(dixon_school['grade'] == 10)]
grade_10

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
45,103118608,Ryan Charles,10,Dixon High School,71.1,93.1,Charter,870334
60,86894214,Jeremiah Smith,10,Dixon High School,59.5,96.4,Charter,870334
69,53464729,Troy Doyle,10,Dixon High School,88.6,89.4,Charter,870334
94,41212637,Matthew Lewis,10,Dixon High School,81.5,83.2,Charter,870334
100,31831251,Jonathan Bell,10,Dixon High School,95.3,80.2,Charter,870334
...,...,...,...,...,...,...,...,...
19283,89972942,Carol Sanford,10,Dixon High School,52.9,77.9,Charter,870334
19306,33033950,John Gibson,10,Dixon High School,58.0,82.0,Charter,870334
19344,55784164,Cynthia Doyle,10,Dixon High School,38.0,82.7,Charter,870334
19368,29598470,Michelle Moore,10,Dixon High School,84.4,59.1,Charter,870334
19445,54346011,David Henry,10,Dixon High School,43.9,90.4,Charter,870334

In [41]:
# Find the mean reading score for all students in grades 11 and 12 combined.
# Sure there's a cleaner approach
Grades_11to12 = student_df.loc[(student_df['grade'] == 11) | (student_df['grade'] == 12)]
avg_reading = Grades_11to12['reading_score'].sum()/6301
avg_reading

74.90038089192191

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [50]:
import pandas as pd
import os

In [51]:
# Create the path and import the data
full_student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [82]:
# Use groupby and mean to find the average reading and math scores for each school type.
type_reading = student_df.groupby(['school_type']).mean()['reading_score']
type_reading

type_math = student_df.groupby(['school_type']).mean()['math_score']
type_math

pub_v_char = [type_math], [type_reading]
pub_v_char

([school_type
  Charter    66.694208
  Public     62.913789
  Name: math_score, dtype: float64],
 [school_type
  Charter    72.550504
  Public     72.290106
  Name: reading_score, dtype: float64])

In [106]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.
total_students_by_school = student_df.groupby(['school_name']).count()['student_id'].sort_values()
total_students_by_school

school_name
Chang High School          213
Campbell High School       539
Odonnell High School       612
Campos High School         717
Richard High School        718
Bowers High School        1051
Fisher High School        1060
Turner High School        1122
Sullivan High School      1273
Woods High School         1373
Silva High School         1452
Wagner High School        2018
Dixon High School         2074
Green High School         2602
Montgomery High School    2690
Name: student_id, dtype: int64

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

*your summary here*

In [ ]:
# Key Observations: Charter schools exhibited higher average reading and math scores, but it should be noted that approximately 1800 more students are enrolled in public schools than charter schools within this dataset. 
# This increases the weight of each individual's score and could prove affect the averages.

In [ ]:
# It may also be interesting to have test scores grouped by grade acrosst the district. This could serve to identify weak points in a specific curriculum area of a given grade.